# MaterialElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryElement..::..MaterialElement Property
GeometryElement Class See Also
---
Element describing the material from which this element is composed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Material MaterialElement { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialElement As Material
	Get
```

Visual C++
---
```text
public:
property Material^ MaterialElement {
	Material^ get ();
}
```

# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace